<?xml version="1.0" ?>
<net batch="1" name="21102019-160139-FP16_32B-NHWC" version="6">
	<layers>
		<layer id="0" name="input_1" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv2d/Conv2D/Transpose_" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="conv2d/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>32</dim>
					<dim>64</dim>
					<dim>126</dim>
					<dim>126</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="1152"/>
			</blobs>
		</layer>
		<layer id="3" name="conv2d/Conv2D/Transpose_332" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>126</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>126</dim>
					<dim>126</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv2d/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1152" size="128"/>
			</blobs>
		</layer>
		<layer id="5" name="conv2d/BiasAdd/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>126</dim>
					<dim>126</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>32</dim>
					<dim>126</dim>
					<dim>126</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv2d/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>126</dim>
					<dim>126</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>126</dim>
					<dim>126</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="max_pooling2d/MaxPool/Transpose_" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>126</dim>
					<dim>126</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>126</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="max_pooling2d/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="3,3"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>126</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>42</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv2d_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>42</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>32</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1280" size="73728"/>
			</blobs>
		</layer>
		<layer id="10" name="conv2d_1/Conv2D/Transpose_348" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2d_1/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="75008" size="128"/>
			</blobs>
		</layer>
		<layer id="12" name="conv2d_1/BiasAdd/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv2d_1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="max_pooling2d_1/MaxPool/Transpose_" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="max_pooling2d_1/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="3,3"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv2d_2/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>13</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>32</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="75136" size="73728"/>
			</blobs>
		</layer>
		<layer id="17" name="conv2d_2/Conv2D/Transpose_364" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>11</dim>
					<dim>11</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv2d_2/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="148864" size="128"/>
			</blobs>
		</layer>
		<layer id="19" name="conv2d_2/BiasAdd/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>11</dim>
					<dim>11</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>32</dim>
					<dim>11</dim>
					<dim>11</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv2d_2/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>11</dim>
					<dim>11</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>11</dim>
					<dim>11</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="max_pooling2d_2/MaxPool/Transpose_" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>11</dim>
					<dim>11</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="max_pooling2d_2/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="3,3"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>11</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv2d_3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<weights offset="148992" size="73728"/>
			</blobs>
		</layer>
		<layer id="24" name="conv2d_3/Conv2D/Transpose_380" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2d_3/BiasAdd/ReadVariableOp/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="222720" size="128"/>
			</blobs>
		</layer>
		<layer id="26" name="conv2d_3/BiasAdd/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv2d_3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="activation/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="60/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="222848" size="8"/>
			</blobs>
		</layer>
		<layer id="30" name="flatten/Reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="dense/MatMul" precision="FP16" type="FullyConnected">
			<data out-size="64"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="222856" size="8192"/>
				<biases offset="231048" size="128"/>
			</blobs>
		</layer>
		<layer id="32" name="dense/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="dense_1/MatMul" precision="FP16" type="FullyConnected">
			<data out-size="1"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<weights offset="231176" size="128"/>
				<biases offset="231304" size="2"/>
			</blobs>
		</layer>
		<layer id="34" name="dense_1/Sigmoid" precision="FP16" type="Activation">
			<data type="sigmoid"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="2" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1"/>
		<edge from-layer="5" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="1"/>
		<edge from-layer="26" from-port="2" to-layer="27" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="28" from-port="1" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="31" to-port="0"/>
		<edge from-layer="31" from-port="3" to-layer="32" to-port="0"/>
		<edge from-layer="32" from-port="1" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="3" to-layer="34" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2019.3.0-375-g332562022"/>
		<cli_parameters>
			<batch value="32"/>
			<blobs_as_inputs value="False"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="True"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR/21102019-160139.pb"/>
			<input_model_is_text value="False"/>
			<keep_quantize_ops_in_IR value="False"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="21102019-160139-FP16_32B-NHWC"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<steps value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="disable_fusing, disable_gfusing, finegrain_fusing, generate_deprecated_IR_V2, input, input_checkpoint, input_meta_graph, input_shape, output, placeholder_shapes, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
